БИТУправление_медицинским_центром_демо/src/Enums/ГруппыЗдоровья/ГруппыЗдоровья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ГруппыЗдоровья</name>
  <comment>OID 1.2.643.5.1.13.13.99.2.766 ФР НСИ ЕГИСЗ а также Приказ Министерства здравоохранения РФ от 13 марта 2019 г. № 124н и от 10 августа 2017 г. N 514н</comment>
  <enumValues>
    <name>I</name>
  </enumValues>
  <enumValues>
    <name>II</name>
  </enumValues>
  <enumValues>
    <name>IIIа</name>
  </enumValues>
  <enumValues>
    <name>IIIб</name>
  </enumValues>
  <enumValues>
    <name>III</name>
    <comment>Удалить</comment>
  </enumValues>
  <enumValues>
    <name>IV</name>
  </enumValues>
  <enumValues>
    <name>V</name>
  </enumValues>
  <enumValues>
    <name>И1</name>
    <comment>Удалить</comment>
  </enumValues>
  <enumValues>
    <name>И2</name>
    <comment>Удалить</comment>
  </enumValues>
  <enumValues>
    <name>И3</name>
    <comment>Удалить</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ГруппыЗдоровья/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает массив групп, применимых для взрослого населения.
// 
// Возвращаемое значение:
//  Массив - массив из элементов перечисления.
//
Функция Взрослые() Экспорт
	
	Группы = Общие();
	
	пчГруппыЗдоровья = Перечисления.ГруппыЗдоровья;
	Группы.Добавить(пчГруппыЗдоровья.IIIа);
	Группы.Добавить(пчГруппыЗдоровья.IIIб);
	
	Возврат Группы;
	
КонецФункции

// Возвращает массив групп, применимых для взрослого населения.
// 
// Возвращаемое значение:
//  Массив - массив из элементов перечисления.
//
Функция Несовершеннолетние() Экспорт
	
	Группы = Общие();
	
	пчГруппыЗдоровья = Перечисления.ГруппыЗдоровья;
	Группы.Добавить(пчГруппыЗдоровья.III);
	Группы.Добавить(пчГруппыЗдоровья.IV);
	Группы.Добавить(пчГруппыЗдоровья.V);
	
	Возврат Группы;
	
КонецФункции

Функция КодыГруппПоФРНСИЕГИСЗ(Группы) Экспорт
	
	КодыГрупп = Новый Соответствие;
	
	ЗначенияПеречисления = Метаданные.Перечисления.ГруппыЗдоровья.ЗначенияПеречисления;
	
	Для Каждого Группа Из Группы Цикл
		КодыГрупп.Вставить(Группа, ЗначенияПеречисления[ЗначенияПеречисления.Индекс(Группа)].Комментарий);
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Группы здоровья, общие для всех возрастных групп.
Функция Общие()
	
	Группы = Новый Массив;
	
	пчГруппыЗдоровья = Перечисления.ГруппыЗдоровья;
	
	Группы.Добавить(пчГруппыЗдоровья.I);
	Группы.Добавить(пчГруппыЗдоровья.II);
	
	Возврат Группы;
	
КонецФункции

#КонецОбласти
